#include "stm32f10x.h"

#include "delay.h"
#include "motor.h"
#include "adc.h"
#include "usart.h"
#include "encoder.h"
#include "key.h"
 /**************************************************************************
作者：轮趣科技（东莞）有限公司
日期：2022.4.2
我的淘宝小店：http://shop114407458.taobao.com/
**************************************************************************/



//------------AT8236模块接线说明---------------                  ------------AT8236带稳压模块版接线说明---------------              
//AT8236模块丝印标识--------STM32F1主板引脚                      AT8236带稳压模块丝印标识--------STM32F1主板引脚
                                     
//    AIN1    -----------    B8                                          E1A    -----------    A0
//    AIN2    -----------    B9                                          E1B    -----------    A1
//    BIN1    -----------    B6                         								 E2A    -----------    A6
//    BIN2    -----------    B7                            							 E2B    -----------    A7
//    VM      -----------    5.5-36V（外接电源）                          ADC     -----------   B1
//    GND     -----------    GND   （外接电源）                           5V     -----------    （AT8236带稳压模块向STM32供电）
//    VCC     -----------    5V   （逻辑电源）                                                                   GND     -----------    GND  （逻辑共地）
//    GND     -----------    GND   （逻辑共地）                                                                    
//                                                                       AIN1    -----------    B8
//                                                                       AIN2    -----------    B9
//																																			 BIN1    -----------    B6
//																																			 BIN2    -----------    B7
//------------电机接线说明---------------
//AT8236模块丝印标识--------电机

//    AO1/BO1   ------------  电机线电源+
//    AO2/BO1   ------------  电机线电源-
//------------接线说明---------------


 int main(void)
 {	
	 u16 adcx;
	 float vcc;
   SystemInit(); 										//配置系统时钟为72M   
	 delay_init();    								//延时函数初始化
	 KEY_Init();
   uart_init(9600);									//串口初始化
	 Encoder_Init_TIM2();            	//=====初始化编码器（TIM2的编码器接口模式） 
	 Encoder_Init_TIM3();            	//=====初始化编码器（TIM3的编码器接口模式）
   adc_Init();											//ADC1的初始化   只有AT8236带稳压模块版才有获取电池电压的功能
	 Motor_PWM_Init(7199,0);  				//=====初始化PWM 10KHZ，用于驱动电机
   
	 
  while(1)
	{
		Set_Pwm(5000,5000);
		delay_ms(5000);
		Set_Pwm(-5000,-5000);

		adcx=Get_adc_Average(ADC_Channel_9,10);  	//获取adc的值
		vcc=(float)adcx*(3.3*11/4096);     				//求当前电压
		printf("当前电压=%6.2f V \r\n",vcc);				//打印当前电压，保留小数点后两位	
	}
 }

